lab_5/autosalon_app/app/controllers/cars_controller.rb

INSERT INTO "cars" ("model", "auto_salon_id", "created_at", "updated_at", "name", "brand", "year") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["model", "Megane"], ["auto_salon_id", nil], ["created_at", "2025-05-05 00:42:25.417460"], ["updated_at", "2025-05-05 00:42:25.417460"], ["name", nil], ["brand", "Renaul"], ["year", 2011]]
---
  def create
      @car = Car.new(car_params)
      if @car.save

UPDATE "cars" SET "updated_at" = ?, "year" = ? WHERE "cars"."id" = ?  [["updated_at", "2025-05-05 08:24:26.120392"], ["year", 2022], ["id", 3]]
---
  def update
      if @car.update(car_params)